documentation/protocol_example.org
#+TITLE: Protocol creation example
#+AUTHOR: Siddhartha Singh
#+OPTIONS: num:nil \n:t
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+HTML_MATHJAX: align: left indent: 2em tagside: left font: Neo-Euler

#+NAME: startup
#+BEGIN_SRC elisp :exports none
  (setq org-confirm-babel-evaluate nil)
#+END_SRC

#+RESULTS: startup

* Introduction
Below is an example of how a protcol would be translated to cpsa syntax and forge predicates. This should be helpful to anyone trying to model a protocol in forge.
* The protocol
Using the ootway rees protocol here from spore primarily because it is a relatively non trivial example (with more than 2 roles, using long term keys etc.) which can currently be modeled by the protocol (note however that we currently cannot model the attack). Below is the protocol stated in arrow notation:

#+NAME: otway-rees-arrow-notation
#+BEGIN_SRC arrow :tangle temp_arrow.txt :comments link
  A, B, S :   	principal
  M, Na, Nb :   	nonce
  Kas, Kbs, Kab :   	key
  1. A -> B: M, A, B, {Na, M, A, B}Kas
  2. B -> S: M, A, B, {Na, M, A, B}Kas, {Nb, M, A, B}Kbs
  3. S -> B: M, {Na, Kab}Kas, {Nb, Kab}Kbs
  4. B -> A: M, {Na, Kab}Kas
#+END_SRC

* The CPSA file
The CPSA file consists of the protocol description in the defprotocol clause and some of the constraints on the genereated run in the defskeleton clause we discuss both of these in turn.
