documentation/protocol_example.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-10-02 Thu 17:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Protocol creation example</title>
<meta name="author" content="Siddhartha Singh" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/code-copy.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Protocol creation example</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgaa24160">Introduction</a></li>
<li><a href="#org7df309e">The protocol</a></li>
<li><a href="#org052b049">The CPSA file</a>
<ul>
<li><a href="#org5b70b8a">defprotocol clause</a></li>
<li><a href="#org0f9649b">defskeleton</a></li>
</ul>
</li>
<li><a href="#org00d9f73">The forge file</a></li>
<li><a href="#orga647d08">Running the protocol</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgaa24160" class="outline-2">
<h2 id="orgaa24160">Introduction</h2>
<div class="outline-text-2" id="text-orgaa24160">
<p>
Below is an example of how a protcol would be translated to cpsa syntax and forge predicates. This should be helpful to anyone trying to model a protocol in forge.<br />
</p>
</div>
</div>
<div id="outline-container-org7df309e" class="outline-2">
<h2 id="org7df309e">The protocol</h2>
<div class="outline-text-2" id="text-org7df309e">
<p>
Using the ootway rees protocol here from spore primarily because it is a relatively non trivial example (with more than 2 roles, using long term keys etc.) which can currently be modeled by the protocol (note however that we currently cannot model the attack). Below is the protocol stated in arrow notation:<br />
</p>

<div class="org-src-container">
<pre class="src src-arrow" id="org5e07ab7">A, B, S :   	principal
M, Na, Nb :   	nonce
Kas, Kbs, Kab :   	key
1. A -&gt; B: M, A, B, {Na, M, A, B}Kas
2. B -&gt; S: M, A, B, {Na, M, A, B}Kas, {Nb, M, A, B}Kbs
3. S -&gt; B: M, {Na, Kab}Kas, {Nb, Kab}Kbs
4. B -&gt; A: M, {Na, Kab}Kas
</pre>
</div>
</div>
</div>
<div id="outline-container-org052b049" class="outline-2">
<h2 id="org052b049">The CPSA file</h2>
<div class="outline-text-2" id="text-org052b049">
<p>
The CPSA file consists of the protocol description in the defprotocol clause and some of the constraints on the genereated run in the defskeleton clause we discuss both of these in turn.<br />
</p>
</div>
