documentation/protocol_example.org
** defprotocol clause
the defprotocol clause only consists of the distinct roles in the protocol, in this case there are 3 different roles (A,B,S)
we first have to separte out the sends and recieves corresponding to each giving us the below.
Trace of A:
#+BEGIN_SRC arrow :tangle temp_arrow.txt :comments link
  A->: M,A,B,{Na,M,A,B}Kas
  ->A: M,{Na,Kab}Kas
#+END_SRC
Trace of B:
#+BEGIN_SRC arrow :tangle temp_arrow.txt :comments link
  -> B: M, A, B, {Na, M, A, B}Kas
  B ->: M, A, B, {Na, M, A, B}Kas, {Nb, M, A, B}Kb
  -> B: M, {Na, Kab}Kas, {Nb, Kab}Kbs
  B ->: M, {Na, Kab}Kas
#+END_SRC
Trace of S:
#+BEGIN_SRC arrow :tangle temp_arrow.txt :comments link
  -> S: M, A, B, {Na, M, A, B}Kas, {Nb, M, A, B}Kbs
  S ->: M, {Na, Kab}Kas, {Nb, Kab}Kbs
#+END_SRC

There is an additional step before we can translate these to CPSA syntax, if a role has an expression like below in its trace
#+BEGIN_SRC cpsa
  (recv (enc m1 m2 k))
#+END_SRC
Where m1,m2 are some message terms and k is the key, then an additional constraint is added that the agent fulfilling this role in any generated run must know the inverse of the key k. The reason behind this constraint is that if a particular role's trace is placing constraints on the content of an encrypted message means it should be able to see the content of the encrypted message. This protocol has an example of such a case in the trace of B, B receives the terms {Na, M, A, B}Kas and {Na, Kab}Kas whose inverse keys it doesn't know.
To fix this problem we add a new variables m1,m2 which are of type *mesg* meaning they can contain any message and replace the two encrypted terms with this. The trace of B looks like below:
#+BEGIN_SRC arrow
  -> B: M, A, B, m1
  B ->: M, A, B, m1, {Nb, M, A, B}Kb
  -> B: M, m2, {Nb, Kab}Kbs
  B ->: M, m2
#+END_SRC
Now these can be translated to CPSA syntax which gives us the following code
#+BEGIN_SRC cpsa
 (defprotocol ootway_rees basic
  (defrole A
    (vars (a b s name) (m na text) (kab skey))
    (trace
     (send (cat m a b (enc na m a b (ltk a s))))
     (recv (cat m (enc na kab (ltk a s))))
     )
    )
  (defrole B
    (vars (a b s name) (m nb text) (kab skey) (first_a_s_mesg second_a_s_mesg mesg))
    (trace
     (recv (cat m a b first_a_s_mesg))
     (send (cat m a b first_a_s_mesg  (enc nb m a b (ltk b s))  )   )
     (recv (cat m second_a_s_mesg (enc nb kab (ltk b s))))
     (send (cat m second_a_s_mesg))
     )
    )
  (defrole S
    (vars (a b s name) (m na nb text) (kab skey))
    (trace
     (recv (cat m a b (enc na m a b (ltk a s))  (enc nb m a b (ltk b s))  )   )
     (send (cat m (enc na kab (ltk a s)) (enc nb kab (ltk b s))))
     )
    )
)
#+END_SRC
Here m1,m2 have been replaced by first_a_S_mesg and second_a_s_mesg respectively.
