documentation/protocol_example.html
<div id="outline-container-org5b70b8a" class="outline-3">
<h3 id="org5b70b8a">defprotocol clause</h3>
<div class="outline-text-3" id="text-org5b70b8a">
<p>
the defprotocol clause only consists of the distinct roles in the protocol, in this case there are 3 different roles (A,B,S)<br />
we first have to separte out the sends and recieves corresponding to each giving us the below.<br />
Trace of A:<br />
</p>
<div class="org-src-container">
<pre class="src src-arrow">A-&gt;: M,A,B,{Na,M,A,B}Kas
-&gt;A: M,{Na,Kab}Kas
</pre>
</div>
<p>
Trace of B:<br />
</p>
<div class="org-src-container">
<pre class="src src-arrow">-&gt; B: M, A, B, {Na, M, A, B}Kas
B -&gt;: M, A, B, {Na, M, A, B}Kas, {Nb, M, A, B}Kb
-&gt; B: M, {Na, Kab}Kas, {Nb, Kab}Kbs
B -&gt;: M, {Na, Kab}Kas
</pre>
</div>
<p>
Trace of S:<br />
</p>
<div class="org-src-container">
<pre class="src src-arrow">-&gt; S: M, A, B, {Na, M, A, B}Kas, {Nb, M, A, B}Kbs
S -&gt;: M, {Na, Kab}Kas, {Nb, Kab}Kbs
</pre>
</div>

<p>
There is an additional step before we can translate these to CPSA syntax, if a role has an expression like below in its trace<br />
</p>
<div class="org-src-container">
<pre class="src src-cpsa"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">recv</span> <span style="color: #bc6ec5;">(</span><span style="color: #bc6ec5; font-weight: bold;">enc</span> m1 m2 k<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
<p>
Where m1,m2 are some message terms and k is the key, then an additional constraint is added that the agent fulfilling this role in any generated run must know the inverse of the key k. The reason behind this constraint is that if a particular role's trace is placing constraints on the content of an encrypted message means it should be able to see the content of the encrypted message. This protocol has an example of such a case in the trace of B, B receives the terms {Na, M, A, B}Kas and {Na, Kab}Kas whose inverse keys it doesn't know.<br />
To fix this problem we add a new variables m1,m2 which are of type <b>mesg</b> meaning they can contain any message and replace the two encrypted terms with this. The trace of B looks like below:<br />
</p>
<div class="org-src-container">
<pre class="src src-arrow">-&gt; B: M, A, B, m1
B -&gt;: M, A, B, m1, {Nb, M, A, B}Kb
-&gt; B: M, m2, {Nb, Kab}Kbs
B -&gt;: M, m2
</pre>
</div>
<p>
Now these can be translated to CPSA syntax which gives us the following code<br />
</p>
<div class="org-src-container">
<pre class="src src-cpsa"> <span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defprotocol</span> ootway_rees <span style="color: #4f97d7;">basic</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">defrole</span> A
    <span style="color: #2d9574;">(</span><span style="color: #4f97d7;">vars</span> <span style="color: #67b11d;">(</span>a b s <span style="color: #ce537a; font-weight: bold;">name</span><span style="color: #67b11d;">)</span> <span style="color: #67b11d;">(</span>m na <span style="color: #ce537a; font-weight: bold;">text</span><span style="color: #67b11d;">)</span> <span style="color: #67b11d;">(</span>kab <span style="color: #ce537a; font-weight: bold;">skey</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">(</span><span style="color: #4f97d7;">trace</span>
     <span style="color: #67b11d;">(</span><span style="color: #4f97d7;">send</span> <span style="color: #b1951d;">(</span><span style="color: #bc6ec5; font-weight: bold;">cat</span> m a b <span style="color: #4f97d7;">(</span><span style="color: #bc6ec5; font-weight: bold;">enc</span> na m a b <span style="color: #bc6ec5;">(</span><span style="color: #bc6ec5; font-weight: bold;">ltk</span> a s<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
     <span style="color: #67b11d;">(</span><span style="color: #4f97d7;">recv</span> <span style="color: #b1951d;">(</span><span style="color: #bc6ec5; font-weight: bold;">cat</span> m <span style="color: #4f97d7;">(</span><span style="color: #bc6ec5; font-weight: bold;">enc</span> na kab <span style="color: #bc6ec5;">(</span><span style="color: #bc6ec5; font-weight: bold;">ltk</span> a s<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
     <span style="color: #2d9574;">)</span>
    <span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">defrole</span> B
    <span style="color: #2d9574;">(</span><span style="color: #4f97d7;">vars</span> <span style="color: #67b11d;">(</span>a b s <span style="color: #ce537a; font-weight: bold;">name</span><span style="color: #67b11d;">)</span> <span style="color: #67b11d;">(</span>m nb <span style="color: #ce537a; font-weight: bold;">text</span><span style="color: #67b11d;">)</span> <span style="color: #67b11d;">(</span>kab <span style="color: #ce537a; font-weight: bold;">skey</span><span style="color: #67b11d;">)</span> <span style="color: #67b11d;">(</span>first_a_s_<span style="color: #ce537a; font-weight: bold;">mesg</span> second_a_s_<span style="color: #ce537a; font-weight: bold;">mesg</span> <span style="color: #ce537a; font-weight: bold;">mesg</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">(</span><span style="color: #4f97d7;">trace</span>
     <span style="color: #67b11d;">(</span><span style="color: #4f97d7;">recv</span> <span style="color: #b1951d;">(</span><span style="color: #bc6ec5; font-weight: bold;">cat</span> m a b first_a_s_<span style="color: #ce537a; font-weight: bold;">mesg</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
     <span style="color: #67b11d;">(</span><span style="color: #4f97d7;">send</span> <span style="color: #b1951d;">(</span><span style="color: #bc6ec5; font-weight: bold;">cat</span> m a b first_a_s_<span style="color: #ce537a; font-weight: bold;">mesg</span>  <span style="color: #4f97d7;">(</span><span style="color: #bc6ec5; font-weight: bold;">enc</span> nb m a b <span style="color: #bc6ec5;">(</span><span style="color: #bc6ec5; font-weight: bold;">ltk</span> b s<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>  <span style="color: #b1951d;">)</span>   <span style="color: #67b11d;">)</span>
     <span style="color: #67b11d;">(</span><span style="color: #4f97d7;">recv</span> <span style="color: #b1951d;">(</span><span style="color: #bc6ec5; font-weight: bold;">cat</span> m second_a_s_<span style="color: #ce537a; font-weight: bold;">mesg</span> <span style="color: #4f97d7;">(</span><span style="color: #bc6ec5; font-weight: bold;">enc</span> nb kab <span style="color: #bc6ec5;">(</span><span style="color: #bc6ec5; font-weight: bold;">ltk</span> b s<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
     <span style="color: #67b11d;">(</span><span style="color: #4f97d7;">send</span> <span style="color: #b1951d;">(</span><span style="color: #bc6ec5; font-weight: bold;">cat</span> m second_a_s_<span style="color: #ce537a; font-weight: bold;">mesg</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
     <span style="color: #2d9574;">)</span>
    <span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">defrole</span> S
    <span style="color: #2d9574;">(</span><span style="color: #4f97d7;">vars</span> <span style="color: #67b11d;">(</span>a b s <span style="color: #ce537a; font-weight: bold;">name</span><span style="color: #67b11d;">)</span> <span style="color: #67b11d;">(</span>m na nb <span style="color: #ce537a; font-weight: bold;">text</span><span style="color: #67b11d;">)</span> <span style="color: #67b11d;">(</span>kab <span style="color: #ce537a; font-weight: bold;">skey</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">(</span><span style="color: #4f97d7;">trace</span>
     <span style="color: #67b11d;">(</span><span style="color: #4f97d7;">recv</span> <span style="color: #b1951d;">(</span><span style="color: #bc6ec5; font-weight: bold;">cat</span> m a b <span style="color: #4f97d7;">(</span><span style="color: #bc6ec5; font-weight: bold;">enc</span> na m a b <span style="color: #bc6ec5;">(</span><span style="color: #bc6ec5; font-weight: bold;">ltk</span> a s<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>  <span style="color: #4f97d7;">(</span><span style="color: #bc6ec5; font-weight: bold;">enc</span> nb m a b <span style="color: #bc6ec5;">(</span><span style="color: #bc6ec5; font-weight: bold;">ltk</span> b s<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>  <span style="color: #b1951d;">)</span>   <span style="color: #67b11d;">)</span>
     <span style="color: #67b11d;">(</span><span style="color: #4f97d7;">send</span> <span style="color: #b1951d;">(</span><span style="color: #bc6ec5; font-weight: bold;">cat</span> m <span style="color: #4f97d7;">(</span><span style="color: #bc6ec5; font-weight: bold;">enc</span> na kab <span style="color: #bc6ec5;">(</span><span style="color: #bc6ec5; font-weight: bold;">ltk</span> a s<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">(</span><span style="color: #bc6ec5; font-weight: bold;">enc</span> nb kab <span style="color: #bc6ec5;">(</span><span style="color: #bc6ec5; font-weight: bold;">ltk</span> b s<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
     <span style="color: #2d9574;">)</span>
    <span style="color: #bc6ec5;">)</span>
<span style="color: #4f97d7;">)</span>
</pre>
</div>
<p>
Here m1,m2 have been replaced by first<sub>a</sub><sub>S</sub><sub>mesg</sub> and second<sub>a</sub><sub>s</sub><sub>mesg</sub> respectively.<br />
</p>
</div>
</div>
