documentation/protocol_example.org
** defskeleton
The defskeleton clause in the CPSA grammar is used to state some constraints on the protocol run. Not all constraints can be stated in this form but any additional constraints can be stated through the forge file.
Below is the list of snippets used to generate an honest run, with an explanation of their functions.

Variables clause declares some variables and their types (you will notice these correspond to the initial part of the description of the protocol in the arrow notation which serves the same purpose.
#+BEGIN_SRC cpsa
  (vars (a b s name) (m na nb text) (kab skey) (A role_A) (B role_B) (S role_S))
#+END_SRC

The variables we defines previously have no correspondence with the variables in the role we declared previously, do establish this correspondence we have to add the below defstrand constraints. (Note how the nonces m,na are generated by A and nb is generated by B, since we later place a constraint that these nonces are freshly generated we ensure m,na are present in defstrand A and nb in defstrand B.)
#+BEGIN_SRC cpsa
  (defstrand A 2 (a a) (b b) (s s) (m m) (na na) (kab kab))
  (defstrand B 2 (nb nb))
#+END_SRC

This constraint ensures that the nonces m,na,nb are distinct hence no nonce is resused. The variables a,b,s mapped to variables of the same name a,b,s in A's role are also marked as being distinct to ensure A doesn't communicate with the same agents for B and S.
#+BEGIN_SRC cpsa
  (not-eq a b) (not-eq a s) (not-eq b s)
  (not-eq m na) (not-eq m nb) (not-eq na nb)
#+END_SRC

This deftrace constraint is not strictly required to generate an honest run, one could expand the defstrand constraint to ensure A,B,S agree on the names a,b,s but deftrace is used here as a useful example. (deftrace is also useful for debugging a protocol specification if we see that some run which we expect to be generated is not generated)
The deftrace constraint here enumerates the sequence of sends and recieves which would take place in an honest run of the protocol. The deftrace constraint ensures that the generated run contains this sequence of sends and recieves but allows for other sends/recieves to be interleaved.
#+BEGIN_SRC cpsa
  (deftrace honest_run
    (send-from A (cat m a b (enc na m a b (ltk a s))))
    (recv-by   B (cat m a b (enc na m a b (ltk a s))))
    (send-from B (cat m a b (enc na m a b (ltk a s)) (enc nb m a b (ltk b s))))
    (recv-by   S (cat m a b (enc na m a b (ltk a s)) (enc nb m a b (ltk b s))))
    (send-from S (cat m (enc na kab (ltk a s)) (enc nb kab (ltk b s))))
    (recv-by   A (cat m (enc na kab (ltk a s))))
    (recv-by   B (cat m (enc na kab (ltk a s)) (enc nb kab (ltk b s))))
    (send-from B (cat m (enc na kab (ltk a s))))
  )
#+END_SRC

Finally non-orig on the long term keys ensures the attacker is not able to generate the long term keys. The uniq-orig constraint ensures that all nonces are freshly generated.
#+BEGIN_SRC cpsa
  (non-orig (ltk a s) (ltk b s))
  (uniq-orig m na kab nb)
#+END_SRC


# Local variables
# org-confirm-babel-evaluate: nil
# eval: (progn (org-babel-goto-named-src-block "startup") (org-babel-execute-src-block) (outline-hide-sublevels 1))
# End:


