documentation/protocol_example.html
<div id="outline-container-org0f9649b" class="outline-3">
<h3 id="org0f9649b">defskeleton</h3>
<div class="outline-text-3" id="text-org0f9649b">
<p>
The defskeleton clause in the CPSA grammar is used to state some constraints on the protocol run. Not all constraints can be stated in this form but any additional constraints can be stated through the forge file.<br />
Below is the list of snippets used to generate an honest run, with an explanation of their functions.<br />
</p>

<p>
Variables clause declares some variables and their types (you will notice these correspond to the initial part of the description of the protocol in the arrow notation which serves the same purpose.<br />
</p>
<div class="org-src-container">
<pre class="src src-cpsa"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">vars</span> <span style="color: #bc6ec5;">(</span>a b s <span style="color: #ce537a; font-weight: bold;">name</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">(</span>m na nb <span style="color: #ce537a; font-weight: bold;">text</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">(</span>kab <span style="color: #ce537a; font-weight: bold;">skey</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">(</span>A role_A<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">(</span>B role_B<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">(</span>S role_S<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
The variables we defines previously have no correspondence with the variables in the role we declared previously, do establish this correspondence we have to add the below defstrand constraints. (Note how the nonces m,na are generated by A and nb is generated by B, since we later place a constraint that these nonces are freshly generated we ensure m,na are present in defstrand A and nb in defstrand B.)<br />
</p>
<div class="org-src-container">
<pre class="src src-cpsa"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defstrand</span> A <span style="color: #a45bad;">2</span> <span style="color: #bc6ec5;">(</span>a a<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">(</span>b b<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">(</span>s s<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">(</span>m m<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">(</span>na na<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">(</span>kab kab<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defstrand</span> B <span style="color: #a45bad;">2</span> <span style="color: #bc6ec5;">(</span>nb nb<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
This constraint ensures that the nonces m,na,nb are distinct hence no nonce is resused. The variables a,b,s mapped to variables of the same name a,b,s in A's role are also marked as being distinct to ensure A doesn't communicate with the same agents for B and S.<br />
</p>
<div class="org-src-container">
<pre class="src src-cpsa"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">not-eq</span> a b<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">not-eq</span> a s<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">not-eq</span> b s<span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">not-eq</span> m na<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">not-eq</span> m nb<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">not-eq</span> na nb<span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
This deftrace constraint is not strictly required to generate an honest run, one could expand the defstrand constraint to ensure A,B,S agree on the names a,b,s but deftrace is used here as a useful example. (deftrace is also useful for debugging a protocol specification if we see that some run which we expect to be generated is not generated)<br />
The deftrace constraint here enumerates the sequence of sends and recieves which would take place in an honest run of the protocol. The deftrace constraint ensures that the generated run contains this sequence of sends and recieves but allows for other sends/recieves to be interleaved.<br />
</p>
<div class="org-src-container">
<pre class="src src-cpsa"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">deftrace</span> honest_run
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7;">send-from</span> A <span style="color: #2d9574;">(</span><span style="color: #bc6ec5; font-weight: bold;">cat</span> m a b <span style="color: #67b11d;">(</span><span style="color: #bc6ec5; font-weight: bold;">enc</span> na m a b <span style="color: #b1951d;">(</span><span style="color: #bc6ec5; font-weight: bold;">ltk</span> a s<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7;">recv-by</span>   B <span style="color: #2d9574;">(</span><span style="color: #bc6ec5; font-weight: bold;">cat</span> m a b <span style="color: #67b11d;">(</span><span style="color: #bc6ec5; font-weight: bold;">enc</span> na m a b <span style="color: #b1951d;">(</span><span style="color: #bc6ec5; font-weight: bold;">ltk</span> a s<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7;">send-from</span> B <span style="color: #2d9574;">(</span><span style="color: #bc6ec5; font-weight: bold;">cat</span> m a b <span style="color: #67b11d;">(</span><span style="color: #bc6ec5; font-weight: bold;">enc</span> na m a b <span style="color: #b1951d;">(</span><span style="color: #bc6ec5; font-weight: bold;">ltk</span> a s<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span> <span style="color: #67b11d;">(</span><span style="color: #bc6ec5; font-weight: bold;">enc</span> nb m a b <span style="color: #b1951d;">(</span><span style="color: #bc6ec5; font-weight: bold;">ltk</span> b s<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7;">recv-by</span>   S <span style="color: #2d9574;">(</span><span style="color: #bc6ec5; font-weight: bold;">cat</span> m a b <span style="color: #67b11d;">(</span><span style="color: #bc6ec5; font-weight: bold;">enc</span> na m a b <span style="color: #b1951d;">(</span><span style="color: #bc6ec5; font-weight: bold;">ltk</span> a s<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span> <span style="color: #67b11d;">(</span><span style="color: #bc6ec5; font-weight: bold;">enc</span> nb m a b <span style="color: #b1951d;">(</span><span style="color: #bc6ec5; font-weight: bold;">ltk</span> b s<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7;">send-from</span> S <span style="color: #2d9574;">(</span><span style="color: #bc6ec5; font-weight: bold;">cat</span> m <span style="color: #67b11d;">(</span><span style="color: #bc6ec5; font-weight: bold;">enc</span> na kab <span style="color: #b1951d;">(</span><span style="color: #bc6ec5; font-weight: bold;">ltk</span> a s<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span> <span style="color: #67b11d;">(</span><span style="color: #bc6ec5; font-weight: bold;">enc</span> nb kab <span style="color: #b1951d;">(</span><span style="color: #bc6ec5; font-weight: bold;">ltk</span> b s<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7;">recv-by</span>   A <span style="color: #2d9574;">(</span><span style="color: #bc6ec5; font-weight: bold;">cat</span> m <span style="color: #67b11d;">(</span><span style="color: #bc6ec5; font-weight: bold;">enc</span> na kab <span style="color: #b1951d;">(</span><span style="color: #bc6ec5; font-weight: bold;">ltk</span> a s<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7;">recv-by</span>   B <span style="color: #2d9574;">(</span><span style="color: #bc6ec5; font-weight: bold;">cat</span> m <span style="color: #67b11d;">(</span><span style="color: #bc6ec5; font-weight: bold;">enc</span> na kab <span style="color: #b1951d;">(</span><span style="color: #bc6ec5; font-weight: bold;">ltk</span> a s<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span> <span style="color: #67b11d;">(</span><span style="color: #bc6ec5; font-weight: bold;">enc</span> nb kab <span style="color: #b1951d;">(</span><span style="color: #bc6ec5; font-weight: bold;">ltk</span> b s<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7;">send-from</span> B <span style="color: #2d9574;">(</span><span style="color: #bc6ec5; font-weight: bold;">cat</span> m <span style="color: #67b11d;">(</span><span style="color: #bc6ec5; font-weight: bold;">enc</span> na kab <span style="color: #b1951d;">(</span><span style="color: #bc6ec5; font-weight: bold;">ltk</span> a s<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
<span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
Finally non-orig on the long term keys ensures the attacker is not able to generate the long term keys. The uniq-orig constraint ensures that all nonces are freshly generated.<br />
</p>
<div class="org-src-container">
<pre class="src src-cpsa"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">non-orig</span> <span style="color: #bc6ec5;">(</span><span style="color: #bc6ec5; font-weight: bold;">ltk</span> a s<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">(</span><span style="color: #bc6ec5; font-weight: bold;">ltk</span> b s<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">uniq-orig</span> m na kab nb<span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>
</div>
