documentation/protocol_example.html
<div id="outline-container-org00d9f73" class="outline-2">
<h2 id="org00d9f73">The forge file</h2>
<div class="outline-text-2" id="text-org00d9f73">
<p>
The following text explains different snippets of the forge file in the order which they appear in in the final forge file.<br />
</p>

<p>
Below code choose what visualization script is used for generating visualization.<br />
</p>
<div class="org-src-container">
<pre class="src src-forge"><span style="color: #4f97d7; font-weight: bold;">option</span> run_sterling <span style="color: #2d9574;">"../../crypto_viz_seq.js"</span>
</pre>
</div>

<p>
wellformed,exec<sub>ootway</sub><sub>rees</sub><sub>A</sub>, constrain<sub>skeleton</sub><sub>ootway</sub><sub>rees</sub><sub>0</sub> refer to predicates. wellformed is a predicate common for any protocol, it imposes constraints like agents only being able to send message terms they have learnt. In the CPSA syntax we had defined roles A,B,S. The predicates exec<sub>ootway</sub><sub>rees</sub><sub>A,B,S</sub> ensure that strands with role A,B,S only send receive messages which were defined in our role trace clause. These three constraints would also be included in any trace we want to generate for this protocol. constrain<sub>skeleton</sub><sub>ootway</sub><sub>rees</sub><sub>0</sub> predicate corresponds to the defskeleton clause we had included in our CPSA file, the constraints there are transcribed and included in this predicate.<br />
</p>
<div class="org-src-container">
<pre class="src src-forge">new_ootway_prot_run : <span style="color: #4f97d7; font-weight: bold;">run</span> <span style="color: #4f97d7;">{</span>
    wellformed
    exec_ootway_rees_A
    exec_ootway_rees_B
    exec_ootway_rees_S
    constrain_skeleton_ootway_rees_0
</pre>
</div>
<p>
These impose the constraint that agents fulfilling the roles A,B,S and Attacker are all distinct since we want to generate an honest run where A,B,S roles wouldn't be played by the Attacker.<br />
</p>
<div class="org-src-container">
<pre class="src src-forge"><span style="color: #4f97d7; font-weight: bold;">let</span> A = ootway_rees_A | <span style="color: #4f97d7;">{</span> <span style="color: #4f97d7; font-weight: bold;">let</span> B = ootway_rees_B | <span style="color: #bc6ec5;">{</span>
<span style="color: #4f97d7; font-weight: bold;">let</span> S = ootway_rees_S | <span style="color: #2d9574;">{</span>
    <span style="color: #67b11d;">(</span>A.agent != Attacker<span style="color: #67b11d;">)</span> <span style="color: #4f97d7; font-weight: bold;">and</span> <span style="color: #67b11d;">(</span>B.agent != Attacker<span style="color: #67b11d;">)</span> <span style="color: #4f97d7; font-weight: bold;">and</span> <span style="color: #67b11d;">(</span>S.agent != Attacker<span style="color: #67b11d;">)</span>
    <span style="color: #67b11d;">(</span>A.agent != B.agent<span style="color: #67b11d;">)</span> <span style="color: #4f97d7; font-weight: bold;">and</span> <span style="color: #67b11d;">(</span>A.agent != S.agent<span style="color: #67b11d;">)</span> <span style="color: #4f97d7; font-weight: bold;">and</span> <span style="color: #67b11d;">(</span>B.agent != S.agent<span style="color: #67b11d;">)</span>
</pre>
</div>
<p>
These impose the constraint that agents A,B,S agree on the names a,b,s.<br />
</p>
<div class="org-src-container">
<pre class="src src-forge"><span style="color: #4f97d7; font-weight: bold;">let</span> A_a = ootway_rees_A_a | <span style="color: #4f97d7;">{</span> <span style="color: #4f97d7; font-weight: bold;">let</span> A_b = ootway_rees_A_b | <span style="color: #bc6ec5;">{</span>
<span style="color: #4f97d7; font-weight: bold;">let</span> A_s = ootway_rees_A_s | <span style="color: #2d9574;">{</span>
    <span style="color: #67b11d;">(</span>A.A_a = A.agent<span style="color: #67b11d;">)</span> <span style="color: #4f97d7; font-weight: bold;">and</span> <span style="color: #67b11d;">(</span>A.A_b = B.agent<span style="color: #67b11d;">)</span> <span style="color: #4f97d7; font-weight: bold;">and</span> <span style="color: #67b11d;">(</span>A.A_s = S.agent<span style="color: #67b11d;">)</span>
<span style="color: #2d9574;">}</span> <span style="color: #bc6ec5;">}</span> <span style="color: #4f97d7;">}</span>
<span style="color: #4f97d7; font-weight: bold;">let</span> B_a = ootway_rees_B_a | <span style="color: #4f97d7;">{</span> <span style="color: #4f97d7; font-weight: bold;">let</span> B_b = ootway_rees_B_b | <span style="color: #bc6ec5;">{</span>
<span style="color: #4f97d7; font-weight: bold;">let</span> B_s = ootway_rees_B_s | <span style="color: #2d9574;">{</span>
    <span style="color: #67b11d;">(</span>B.B_a = A.agent<span style="color: #67b11d;">)</span> <span style="color: #4f97d7; font-weight: bold;">and</span> <span style="color: #67b11d;">(</span>B.B_b = B.agent<span style="color: #67b11d;">)</span> <span style="color: #4f97d7; font-weight: bold;">and</span> <span style="color: #67b11d;">(</span>B.B_s = S.agent<span style="color: #67b11d;">)</span>
<span style="color: #2d9574;">}</span> <span style="color: #bc6ec5;">}</span> <span style="color: #4f97d7;">}</span>
<span style="color: #4f97d7; font-weight: bold;">let</span> S_a = ootway_rees_S_a | <span style="color: #4f97d7;">{</span> <span style="color: #4f97d7; font-weight: bold;">let</span> S_b = ootway_rees_S_b | <span style="color: #bc6ec5;">{</span>
<span style="color: #4f97d7; font-weight: bold;">let</span> S_s = ootway_rees_S_s | <span style="color: #2d9574;">{</span>
    <span style="color: #67b11d;">(</span>S.S_a = A.agent<span style="color: #67b11d;">)</span> <span style="color: #4f97d7; font-weight: bold;">and</span> <span style="color: #67b11d;">(</span>S.S_b = B.agent<span style="color: #67b11d;">)</span> <span style="color: #4f97d7; font-weight: bold;">and</span> <span style="color: #67b11d;">(</span>S.S_s = S.agent<span style="color: #67b11d;">)</span>
<span style="color: #2d9574;">}</span> <span style="color: #bc6ec5;">}</span> <span style="color: #4f97d7;">}</span>
</pre>
</div>
<p>
These ensure that k<sub>ab</sub> is not equal to long term keys previously generated.<br />
</p>
<div class="org-src-container">
<pre class="src src-forge"><span style="color: #4f97d7; font-weight: bold;">let</span> k_ab = S.ootway_rees_S_kab | <span style="color: #4f97d7;">{</span>
    <span style="color: #bc6ec5;">(</span>k_ab != getLTK<span style="color: #2d9574;">[</span>A.agent,S.agent<span style="color: #2d9574;">]</span><span style="color: #bc6ec5;">)</span> <span style="color: #4f97d7; font-weight: bold;">and</span> <span style="color: #bc6ec5;">(</span>k_ab != getLTK<span style="color: #2d9574;">[</span>B.agent,S.agent<span style="color: #2d9574;">]</span><span style="color: #bc6ec5;">)</span> <span style="color: #4f97d7; font-weight: bold;">and</span> <span style="color: #bc6ec5;">(</span>k_ab != getLTK<span style="color: #2d9574;">[</span>A.agent,B.agent<span style="color: #2d9574;">]</span><span style="color: #bc6ec5;">)</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
<p>
This imposes the constraint on the size of different sets defined through sig, for an honest run one can compute these by hand.<br />
</p>
<div class="org-src-container">
<pre class="src src-forge">    <span style="color: #e0211d; text-decoration: overline;">}</span> <span style="color: #e0211d; text-decoration: overline;">}</span> <span style="color: #e0211d; text-decoration: overline;">}</span>
<span style="color: #e0211d; text-decoration: overline;">}</span> <span style="color: #4f97d7; font-weight: bold;">for</span>
    <span style="color: #4f97d7; font-weight: bold;">exactly</span> <span style="color: #a45bad;">8</span> Timeslot,<span style="color: #4f97d7; font-weight: bold;">exactly</span> <span style="color: #a45bad;">24</span> mesg,<span style="color: #4f97d7; font-weight: bold;">exactly</span> <span style="color: #a45bad;">24</span> text,<span style="color: #4f97d7; font-weight: bold;">exactly</span> <span style="color: #a45bad;">24</span> atomic,
    <span style="color: #4f97d7; font-weight: bold;">exactly</span> <span style="color: #a45bad;">7</span> Key,<span style="color: #4f97d7; font-weight: bold;">exactly</span> <span style="color: #a45bad;">0</span> akey,<span style="color: #4f97d7; font-weight: bold;">exactly</span> <span style="color: #a45bad;">7</span> skey,<span style="color: #4f97d7; font-weight: bold;">exactly</span> <span style="color: #a45bad;">0</span> PrivateKey,<span style="color: #4f97d7; font-weight: bold;">exactly</span> <span style="color: #a45bad;">0</span> PublicKey,
    <span style="color: #4f97d7; font-weight: bold;">exactly</span> <span style="color: #a45bad;">4</span> name,<span style="color: #4f97d7; font-weight: bold;">exactly</span> <span style="color: #a45bad;">9</span> Ciphertext,<span style="color: #4f97d7; font-weight: bold;">exactly</span> <span style="color: #a45bad;">4</span> nonce,<span style="color: #4f97d7; font-weight: bold;">exactly</span> <span style="color: #a45bad;">1</span> KeyPairs,
    <span style="color: #4f97d7; font-weight: bold;">exactly</span> <span style="color: #a45bad;">1</span> ootway_rees_A,<span style="color: #4f97d7; font-weight: bold;">exactly</span> <span style="color: #a45bad;">1</span> ootway_rees_B,
    <span style="color: #4f97d7; font-weight: bold;">exactly</span> <span style="color: #a45bad;">1</span> ootway_rees_S
<span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #e0211d; text-decoration: overline;">{</span> next <span style="color: #4f97d7; font-weight: bold;">is</span> linear <span style="color: #e0211d; text-decoration: overline;">}</span>
</pre>
</div>
<p>
Only including the bound 24 mesg and a few other sets should be enough as mesg is the superset of most of the other sets. However solving is exteremly slow with this, on my machine it didn't terminate after around 25 minutes while with the given constraints it terminates in 2-3 minutes.<br />
</p>
</div>
</div>
<div id="outline-container-orga647d08" class="outline-2">
<h2 id="orga647d08">Running the protocol</h2>
<div class="outline-text-2" id="text-orga647d08">
<p>
Now that we have created our CPSA and forge files we can now run this protocol using the following<br />
</p>
<div class="org-src-container">
<pre class="src src-shell">python3 main_seq_text.py racket_file forge_file --destination_forge_file_path destination_file
</pre>
</div>
<p>
Above command generates a forge file which includes the content from our <b>forge<sub>file</sub></b> and the contents of our <b>racket<sub>file</sub></b> transcribed to forge predicates.<br />
To run the forge file you have to run the below command.<br />
</p>
<div class="org-src-container">
<pre class="src src-shell">racket destination_file
</pre>
</div>
<p>
The visualizer opens up in your forge file.<br />
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Siddhartha Singh</p>
<p class="date">Created: 2025-10-02 Thu 17:52</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
